# ExtrusionDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtrusionAnalyzer..::..ExtrusionDirection Property
ExtrusionAnalyzer Class See Also
---
The direction of extrusion specified for the extrusion analysis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ ExtrusionDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ExtrusionDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ ExtrusionDirection {
	XYZ^ get ();
}
```

# See Also
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace